#include "Main.h"
#include "Game.h"
#include "Float2.h"
#include "Random.h"
#include "Hit.h"
#include "Map.h"

Map map;

Float2 box = { 10.0f,0.0f };

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	map.Init();
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	map.Update(box);

	//一時てきにプレイヤーの代わりに操作する
	if (CheckHitKey(KEY_INPUT_SPACE))
	{
		box.y -= 15.0f;     //JUMP
	}
	if (CheckHitKey(KEY_INPUT_D))
	{
		box.x += 1.0f;     //RIGHT
	}
	if (CheckHitKey(KEY_INPUT_A))
	{
		box.x -= 5.0f;     //LEFT
	}
	
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	
	map.Render();
	DrawCircle(box.x, box.y, 10, GetColor(255, 255, 255), TRUE);
	DrawFormatString(10 + 20, 10, GetColor(255, 255, 255), "%d", ((int)box.y / GROUND_SIZE));
	
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
	
}
